using System;

namespace Project
{
    class Program
    {
        static void Main(string[] args)
        {
            // Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя).
            /*
            int value = 5;

            int result = value * value;

            Console.WriteLine(result);
            */

            Console.WriteLine("hi");
        }
    }
}